; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v5)
		(pred_4 ?v4)
		(pred_6 ?v3)
		(pred_5 ?v3)
		(pred_2 ?v4 ?v3)
		(pred_3)
		(pred_1 ?v4))

   (:action op_3
       :parameters  (?v2 ?v6)
       :precondition (and (not-eq ?v2 ?v6) 
                          (pred_6 ?v2) (pred_6 ?v6) (pred_5 ?v2))
       :effect (and  (pred_5 ?v6)
		     (not (pred_5 ?v2))))


   (:action op_1
       :parameters (?v1 ?v8)
       :precondition  (and  (pred_4 ?v1) (pred_6 ?v8)
			    (pred_2 ?v1 ?v8) (pred_5 ?v8) (pred_3))
       :effect (and (pred_1 ?v1)
		    (not (pred_2 ?v1 ?v8)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v1  ?v8)
       :precondition  (and  (pred_4 ?v1) (pred_6 ?v8)
			    (pred_1 ?v1) (pred_5 ?v8))
       :effect (and (pred_2 ?v1 ?v8)
		    (pred_3)
		    (not (pred_1 ?v1)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_02 obj_01 
          obj_03 obj_05 obj_04 
)
(:init
(pred_6 obj_06)
(pred_6 obj_02)
(pred_6 obj_01)
(pred_4 obj_03)
(pred_4 obj_05)
(pred_4 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(pred_3)
(pred_2 obj_03 obj_02)
(pred_2 obj_05 obj_02)
(pred_2 obj_04 obj_01)
(pred_5 obj_06)
)
(:goal
(and
(pred_2 obj_03 obj_06)
(pred_2 obj_05 obj_06)
(pred_2 obj_04 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_03 obj_06) (pred_5 obj_01))
    (sometime-before  (pred_2 obj_05 obj_06) (pred_5 obj_01))
  )
)
)

; plan
1. (op_3 obj_06 obj_02)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_02)
   goals met: 1 of 3
2. (op_1 obj_05 obj_02)
   deleted: (pred_2 obj_05 obj_02) (pred_3)
   added: (pred_1 obj_05)
   goals met: 1 of 3
3. (op_3 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_01)
   goals met: 1 of 3
4. (op_2 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_2 obj_05 obj_01) (pred_3)
   goals met: 1 of 3
5. (op_3 obj_01 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_02)
   goals met: 1 of 3
6. (op_1 obj_03 obj_02)
   deleted: (pred_2 obj_03 obj_02) (pred_3)
   added: (pred_1 obj_03)
   goals met: 1 of 3
7. (op_3 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_06)
   goals met: 1 of 3
8. (op_2 obj_03 obj_06)
   deleted: (pred_1 obj_03)
   added: (pred_2 obj_03 obj_06) (pred_3)
   goals met: 2 of 3
9. (op_3 obj_06 obj_01)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_01)
   goals met: 2 of 3
10. (op_1 obj_05 obj_01)
   deleted: (pred_2 obj_05 obj_01) (pred_3)
   added: (pred_1 obj_05)
   goals met: 2 of 3
11. (op_3 obj_01 obj_06)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_06)
   goals met: 2 of 3
12. (op_2 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_2 obj_05 obj_06) (pred_3)
   goals met: 3 of 3
